-------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/morinl/SAAQ/check_FE/Stata_FE_CRVE_sim_test.log
  log type:  text
 opened on:   3 Aug 2021, 21:45:51

. 
. * Clear memory.
. clear all

. 
. /*******************************************************************************
>  * Load Data
>  *******************************************************************************
> */
. 
. 
. * Import dataset.
. import delimited using Stata_FE_CRVE_sim_data.csv , delimiters(",")
(6 vars, 5,113,500 obs)

. * Dataset has the following variables:
. * check_var_names <- c('date_stata', 'seq', 'age_grp', 'curr_pts_grp',
. *                      'policy_int', 'events_int')
. 
. 
. /*******************************************************************************
>  * Inspect data
>  *******************************************************************************
> */
. 
. * Determine variable types.
. foreach var of varlist _all {
  2.   display " `var' "  _col(20) "`: type `var''"
  3. }
 date_stata        str9
 seq               int
 age_grp           str6
 curr_pts_grp      str6
 policy_int        byte
 events_int        byte

. 
. 
. * Integers.
. summarize(seq)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         seq |  5,113,500      1750.5    1010.363          1       3500

. 
. * Binary variables (as integers).
. summarize(events_int)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  events_int |  5,113,500    .0466287    .2108424          0          1

. tabulate(events_int)

 events_int |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  4,875,064       95.34       95.34
          1 |    238,436        4.66      100.00
------------+-----------------------------------
      Total |  5,113,500      100.00

. summarize(policy_int)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  policy_int |  5,113,500    .4996578    .4999999          0          1

. tabulate(policy_int)

 policy_int |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,558,500       50.03       50.03
          1 |  2,555,000       49.97      100.00
------------+-----------------------------------
      Total |  5,113,500      100.00

. 
. * Categorical variables.
. summarize(curr_pts_grp)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
curr_pts_grp |          0

. tabulate(curr_pts_grp)

curr_pts_gr |
          p |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,687,985       72.12       72.12
          1 |    256,123        5.01       77.13
         10 |     25,713        0.50       77.63
      11-20 |     12,676        0.25       77.88
          2 |    229,917        4.50       82.38
      21-30 |      5,009        0.10       82.48
          3 |    204,578        4.00       86.48
     31-150 |        496        0.01       86.49
          4 |    179,285        3.51       89.99
          5 |    153,258        3.00       92.99
          6 |    128,245        2.51       95.50
          7 |    102,621        2.01       97.50
          8 |     76,472        1.50       99.00
          9 |     51,122        1.00      100.00
------------+-----------------------------------
      Total |  5,113,500      100.00

. summarize(age_grp)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     age_grp |          0

. tabulate(age_grp)

    age_grp |      Freq.     Percent        Cum.
------------+-----------------------------------
       0-19 |    730,500       14.29       14.29
      20-24 |    730,500       14.29       28.57
      25-34 |    730,500       14.29       42.86
      35-44 |    730,500       14.29       57.14
      45-54 |    730,500       14.29       71.43
      55-64 |    730,500       14.29       85.71
     65-199 |    730,500       14.29      100.00
------------+-----------------------------------
      Total |  5,113,500      100.00

. 
. * Generate new categorical variables.
. encode curr_pts_grp, generate(curr_pts_grp_cat)

. encode age_grp, generate(age_grp_cat)

. 
. tabulate(curr_pts_grp_cat)

curr_pts_gr |
      p_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,687,985       72.12       72.12
          1 |    256,123        5.01       77.13
         10 |     25,713        0.50       77.63
      11-20 |     12,676        0.25       77.88
          2 |    229,917        4.50       82.38
      21-30 |      5,009        0.10       82.48
          3 |    204,578        4.00       86.48
     31-150 |        496        0.01       86.49
          4 |    179,285        3.51       89.99
          5 |    153,258        3.00       92.99
          6 |    128,245        2.51       95.50
          7 |    102,621        2.01       97.50
          8 |     76,472        1.50       99.00
          9 |     51,122        1.00      100.00
------------+-----------------------------------
      Total |  5,113,500      100.00

. tabulate(age_grp_cat)

age_grp_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
       0-19 |    730,500       14.29       14.29
      20-24 |    730,500       14.29       28.57
      25-34 |    730,500       14.29       42.86
      35-44 |    730,500       14.29       57.14
      45-54 |    730,500       14.29       71.43
      55-64 |    730,500       14.29       85.71
     65-199 |    730,500       14.29      100.00
------------+-----------------------------------
      Total |  5,113,500      100.00

. 
. 
. * Verify new variable types.
. * For loops look so rudimentary in Stata:
. foreach var of varlist _all {
  2.   display " `var' "  _col(20) "`: type `var''"
  3. }
 date_stata        str9
 seq               int
 age_grp           str6
 curr_pts_grp      str6
 policy_int        byte
 events_int        byte
 curr_pts_grp_cat  long
 age_grp_cat       long

. 
. 
. /*******************************************************************************
>  * Set variables for panel data
>  *******************************************************************************
> */
. 
. * Date is in a string format.
. * Must be converted to a date format.
. generate xtdate = date(date_stata,"DMY")

. format xtdate %tCDDmonCCYY

. 
. * Declare time and id variables.
. xtset seq xtdate
       panel variable:  seq (strongly balanced)
        time variable:  xtdate, 01jan1960 to 01jan1960
                delta:  .001 seconds

. 
. 
. /*******************************************************************************
>  * Estimate Model
>  * Fixed effect regression with cluster-robust standard errors
>  *******************************************************************************
> */
. 
. * Run with cluster-robust standard errors, clustered on the driver ID.
. xtreg events_int i.curr_pts_grp_cat##policy_int, fe vce(cluster seq)

Fixed-effects (within) regression               Number of obs     =  5,113,500
Group variable: seq                             Number of groups  =      3,500

R-sq:                                           Obs per group:
     within  = 0.0220                                         min =      1,461
     between = 0.0124                                         avg =    1,461.0
     overall = 0.0220                                         max =      1,461

                                                F(27,3499)        =    5584.21
corr(u_i, Xb)  = 0.0002                         Prob > F          =     0.0000

                                               (Std. Err. adjusted for 3,500 clusters in seq)
---------------------------------------------------------------------------------------------
                            |               Robust
                 events_int |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
           curr_pts_grp_cat |
                         1  |  -.0785287   .0002266  -346.53   0.000     -.078973   -.0780844
                        10  |  -.0785291   .0002337  -336.01   0.000    -.0789873   -.0780709
                     11-20  |  -.0786755    .000243  -323.82   0.000    -.0791518   -.0781991
                         2  |  -.0785199   .0002263  -346.92   0.000    -.0789636   -.0780761
                     21-30  |  -.0783958   .0002586  -303.15   0.000    -.0789029   -.0778888
                         3  |  -.0785566   .0002265  -346.83   0.000    -.0790007   -.0781125
                    31-150  |  -.0788325   .0004935  -159.76   0.000       -.0798   -.0778651
                         4  |  -.0785107   .0002268  -346.18   0.000    -.0789553    -.078066
                         5  |  -.0785293   .0002279  -344.65   0.000    -.0789761   -.0780826
                         6  |  -.0785093   .0002288  -343.14   0.000    -.0789578   -.0780607
                         7  |  -.0784716   .0002285  -343.43   0.000    -.0789196   -.0780236
                         8  |  -.0785053   .0002277  -344.78   0.000    -.0789517   -.0780588
                         9  |  -.0785376   .0002314  -339.46   0.000    -.0789912    -.078084
                            |
               1.policy_int |  -.0277544   .0002536  -109.44   0.000    -.0282517   -.0272572
                            |
curr_pts_grp_cat#policy_int |
                       1#1  |   .0277601   .0002554   108.69   0.000     .0272594    .0282609
                      10#1  |    .027789   .0002684   103.52   0.000     .0272627    .0283153
                   11-20#1  |   .0279476   .0002796    99.94   0.000     .0273994    .0284959
                       2#1  |   .0277422   .0002552   108.71   0.000     .0272418    .0282425
                   21-30#1  |   .0275644   .0003225    85.47   0.000     .0269321    .0281967
                       3#1  |    .027774   .0002549   108.98   0.000     .0272743    .0282737
                  31-150#1  |   .0278545   .0006719    41.46   0.000     .0265372    .0291718
                       4#1  |   .0276892   .0002554   108.42   0.000     .0271884    .0281899
                       5#1  |   .0277546   .0002571   107.94   0.000     .0272505    .0282588
                       6#1  |   .0277697   .0002557   108.62   0.000     .0272685     .028271
                       7#1  |   .0277122   .0002586   107.15   0.000     .0272052    .0282193
                       8#1  |   .0277276   .0002605   106.46   0.000     .0272169    .0282382
                       9#1  |   .0277848   .0002614   106.28   0.000     .0272723    .0282974
                            |
                      _cons |   .0785278   .0001416   554.39   0.000     .0782501    .0788055
----------------------------+----------------------------------------------------------------
                    sigma_u |  .00722877
                    sigma_e |  .20845358
                        rho |  .00120112   (fraction of variance due to u_i)
---------------------------------------------------------------------------------------------

. 
. 
. /*******************************************************************************
>  * Closing arguments
>  *******************************************************************************
> */
. 
. * Closing arguments.
. log close
      name:  <unnamed>
       log:  /home/morinl/SAAQ/check_FE/Stata_FE_CRVE_sim_test.log
  log type:  text
 closed on:   3 Aug 2021, 21:46:58
-------------------------------------------------------------------------------------------------------------------
